IDEA Open Model
CheckResAnchor Class
Compatible with IDEA StatiCa Beta 20.0
 Check value for Anchor
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CheckResAnchor
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class CheckResAnchor
<SerializableAttribute>
Public Class CheckResAnchor
The CheckResAnchor type exposes the following members.
Constructors
Name | Description
CheckResAnchor
Initializes a new instance of the CheckResAnchor class
Top
Properties
Name | Description
CheckStatus
 Status of the Check
LoadCaseId
 Id of Load Case
Name
 Name
UnityCheck
 Unity Check
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace